; RegExMenu1.ini
; https://t.me/tcimg
; Файл меню вставки метасимволов в шаблон поиска в команде regex
; Кодировка UTF-16 LE 1200
; Синтаксис:
; -----------------------------------
; [Section]
; i=Метасимволы⣿Описание (не обязательно)
; -----------------------------------
; Разделитель символ ⣿ - ChrW(10495) - &#10495; - \28FF - U+28FF
; Метасимволы из секции [1] отображаются в корне меню
; Если в ключе i= ничего не прописано, то в меню вставляется разделитель
; Комментарии в секциях не поддерживаются
; Знак & (амперсанд) необходимо удваивать
; [-] - пустая секция означает разделитель

[1]

[Метасимволы]
i=.⣿любой символ (точка)
i=\h⣿пробел и табуляция [ \t]
i=\H⣿не пробел и не табуляция [^\h]
i=\Q\E⣿\Qметасимволы как текст\E
i=\e⣿символ escape \x1B
i=\f⣿перевод страницы \x0C
i=\z⣿абсолютный конец текста
i=\n⣿перевод строки \x0A
i=\N⣿не символ переноса [^\n]
i=\r⣿перевод строки \x0D
i=\R⣿переносы строки [\n\f\r\v]
i=\t⣿табуляция \x09
i=\v⣿вертикальная табуляция [\r\n\f]
i=\V⣿не вертикальная табуляция [^\v]
i=\G⣿предыдущий поиск
i=\K⣿последующий поиск

[Границы символов]
i=^⣿начало строки
i=$⣿конец строки
i=\A⣿начало документа
i=\z⣿конец документа
i=\Z⣿конец текста
i=\b⣿граница слова
i=\B⣿не граница слова

[Группы символов]
i=\d⣿цифра [0-9]
i=\D⣿не цифра [^0-9]
i=\s⣿пробельный символ [\f\n\r\t\v ]
i=\S⣿непробельный символ [^\f\n\r\t\v ]
i=\w⣿словесный символ [0-9a-zA-Z_]
i=\W⣿несловесный символ [^0-9a-zA-Z_]
i=
i=ab|xy⣿одна из альтернатив: ab либо xy
i=[abc]⣿набор необходимых символов
i=[^abc]⣿исключающий набор символов
i=[a-z]⣿диапазон символов
i=[^a-z]⣿исключающий диапазон

[Модификаторы]
i=(?i)⣿не учитывает регистр символов
i=(?m)⣿многострочный поиск
i=(?s)⣿точке соответствует любой символ
i=(?U)⣿инвертирует жадность квантификаторов
i=(?x)⣿игнорирует пробелы и табуляцию
i=(?ms)⣿
i=(?ims)⣿
i=
i=(?-i)⣿отменяет ранее включенный (?i)
i=(?-m)⣿отменяет ранее включенный (?m)
i=(?-s)⣿отменяет ранее включенный (?s)
i=(?-U)⣿отменяет ранее включенный (?U)
i=(?-x)⣿отменяет ранее включенный (?x)

[Группы]
i=(i:)⣿не учитывает регистр
i=(-i:)⣿учитывает регистр
i=(?:)⣿исключает из найденных
i=(?>)⣿сверхжадный захват
i=
i=(?=)⣿совпадение после
i=(?!)⣿не совпадение после
i=(?<=)⣿совпадение начала
i=(?<!)⣿не  начала
i=(?|)⣿без захвата со сбросом

[Повтор]
i={2}⣿равно 2 раза
i={2,}⣿не менее 2 раз
i={2,4}⣿от 2 до 4 раз
i=
i=?⣿0 или 1 раз {0,1}
i=*⣿0 и более раз {0,}
i=+⣿1 и более раз {1,}
i=
i=??⣿наименьший захват
i=*?⣿0 и более раз (не жадный)
i=+?⣿1 и более раз (не жадный)
i=
i=*+⣿0 и более раз (сверхжадный)
i=++⣿1 и более раз (сверхжадный)

[Числа и Условия]
i=\x{01}⣿шестнадцатеричная цифра 0-10FFFF
i=\x41⣿шестнадцатеричная двузначная цифра
i=\120⣿восьмеричная цифра
i=
i=[\dA-Fa-f]
i=
i=(?(if)yes)⣿(?(если)то)
i=(?(if)yes|no)⣿(?(если)то|иначе)
i=
i=(?(?=pattern)|.+?)⣿инверсия: кроме заданного

[Posix]
i=[[:alnum:]]⣿буквы и цифры [0-9A-Za-z]
i=[[:alpha:]]⣿буквы [A-Za-z]
i=[[:ascii:]]⣿символы от \x00 до \x7F
i=[[:blank:]]⣿пробел и табуляция [\t ]
i=[[:cntrl:]]⣿управляющие символы \x00 \x1F \x7F
i=[[:digit:]]⣿десятичные цифры [0-9]
i=[[:lower:]]⣿прописные буквы [a-z]
i=[[:upper:]]⣿заглавные буквы [A-Z]
i=[[:space:]]⣿пробельные символы [\f\n\r\t\v ]
i=[[:word:]]⣿символы слов, тоже что \w
i=[[:xdigit:]]⣿шестнадцатеричные цифры [0-9A-Fa-f]
i=
i=[[:print:]]⣿символы печати от \x20 до \x7E
i=[[:graph:]]⣿символы печати от \x21 до \x7E
i=[[:punct:]]⣿символы печати, кроме [:alnum:] и [:cntrl:]

[(*UCP)]
i=(*UCP)⣿включает Unicode для \w, \v + \p{Name}
i=\p{Cyrillic}⣿только кириллические символы
i=\p{L}⣿буквенные символы
i=\p{Ll}⣿буквы в нижнем регистре
i=\p{Lu}⣿буквы в верхнем регистре
i=\p{P}⣿знаки препинания
i=\p{Pe}⣿закрывающиеся скобки
i=\p{Ps}⣿открывающиеся скобки 
i=\p{Sm}⣿математические символы
i=\p{Sc}⣿символы валюты

[-]

[Пользовательские]
i=\r\n
i=[\r\n]
i=(\r\n|\r|\n)
i=[А-яЁё]
i=[^]
i=(.+)

